In [1]:
import pandas as pd
import numpy as np

import matplotlib.pyplot as plt
import matplotlib
matplotlib.rcParams['font.family']='Malgun Gothic'
matplotlib.rcParams['axes.unicode_minus']=False

In [2]:
np.random.seed(1)
data = np.random.randint(30,101, size=(4,6) )
data

array([[67, 42, 39, 35, 94, 46],
       [31, 36, 55, 80, 50, 48],
       [41, 58, 59, 44, 80, 98],
       [43, 39, 37, 93, 91, 52]])

In [3]:
df = pd.DataFrame( data )
df

    0   1   2   3   4   5
0  67  42  39  35  94  46
1  31  36  55  80  50  48
2  41  58  59  44  80  98
3  43  39  37  93  91  52

In [4]:
df['년도'] = [2020,2020,2021,2021]
df['학년'] = ['1학년','2학년','1학년','2학년']

In [5]:
df

    0   1   2   3   4   5    년도   학년
0  67  42  39  35  94  46  2020  1학년
1  31  36  55  80  50  48  2020  2학년
2  41  58  59  44  80  98  2021  1학년
3  43  39  37  93  91  52  2021  2학년

In [6]:
df.set_index(['년도','학년'])  #멀티인덱스

           0   1   2   3   4   5
년도   학년
2020 1학년  67  42  39  35  94  46
     2학년  31  36  55  80  50  48
2021 1학년  41  58  59  44  80  98
     2학년  43  39  37  93  91  52

In [7]:
df.index = pd.MultiIndex.from_product([[2020,2021],['1학년','2학년']],names=['년도','학년'])  #멀티인덱스

In [8]:
df

           0   1   2   3   4   5    년도   학년
년도   학년
2020 1학년  67  42  39  35  94  46  2020  1학년
     2학년  31  36  55  80  50  48  2020  2학년
2021 1학년  41  58  59  44  80  98  2021  1학년
     2학년  43  39  37  93  91  52  2021  2학년

In [9]:
df.index

MultiIndex([(2020, '1학년'),
            (2020, '2학년'),
            (2021, '1학년'),
            (2021, '2학년')],
           names=['년도', '학년'])

In [10]:
print(type(df.index))

<class 'pandas.core.indexes.multi.MultiIndex'>

In [11]:
df.index.levels #정렬되어서 출력

FrozenList([[2020, 2021], ['1학년', '2학년']])

In [12]:
df.index.levels[0]

Int64Index([2020, 2021], dtype='int64', name='년도')

In [13]:
df.index.levels[1]

Index(['1학년', '2학년'], dtype='object', name='학년')

In [14]:
df.index.get_level_values(0)

Int64Index([2020, 2020, 2021, 2021], dtype='int64', name='년도')

In [15]:
df.index.get_level_values('년도')

Int64Index([2020, 2020, 2021, 2021], dtype='int64', name='년도')

In [16]:
df.index.get_level_values('학년')

Index(['1학년', '2학년', '1학년', '2학년'], dtype='object', name='학년')

In [48]:
df.index.unique() # 정렬되지 않고 선언된 그대로

MultiIndex([(2020, '1학년'),
            (2020, '2학년'),
            (2021, '1학년'),
            (2021, '2학년')],
           names=['년도', '학년'])

In [17]:
df.index.unique(0)  #중복x 하나씩만

Int64Index([2020, 2021], dtype='int64', name='년도')

In [18]:
df.index.unique(1)

Index(['1학년', '2학년'], dtype='object', name='학년')

In [19]:
df.drop(columns=['년도','학년'],inplace=True)

In [20]:
df

           0   1   2   3   4   5
년도   학년
2020 1학년  67  42  39  35  94  46
     2학년  31  36  55  80  50  48
2021 1학년  41  58  59  44  80  98
     2학년  43  39  37  93  91  52

In [21]:
df.reset_index() # 인덱스 리셋. 원래대로

     년도   학년   0   1   2   3   4   5
0  2020  1학년  67  42  39  35  94  46
1  2020  2학년  31  36  55  80  50  48
2  2021  1학년  41  58  59  44  80  98
3  2021  2학년  43  39  37  93  91  52

In [24]:
df.columns = pd.MultiIndex.from_product([['홍길동','이순신','임꺽정'],['국어','영어']])  #멀티컬럼

In [25]:
df

         홍길동     이순신     임꺽정
          국어  영어  국어  영어  국어  영어
년도   학년
2020 1학년  67  42  39  35  94  46
     2학년  31  36  55  80  50  48
2021 1학년  41  58  59  44  80  98
     2학년  43  39  37  93  91  52

In [26]:
print(type(df.columns))

<class 'pandas.core.indexes.multi.MultiIndex'>

In [28]:
df.columns.levels

FrozenList([['이순신', '임꺽정', '홍길동'], ['국어', '영어']])

In [29]:
df.columns.levels[0]

Index(['이순신', '임꺽정', '홍길동'], dtype='object')

In [30]:
df.columns.levels[1]

Index(['국어', '영어'], dtype='object')

In [31]:
df.loc[2020]

    홍길동     이순신     임꺽정
     국어  영어  국어  영어  국어  영어
학년
1학년  67  42  39  35  94  46
2학년  31  36  55  80  50  48

In [32]:
df['홍길동']

          국어  영어
년도   학년
2020 1학년  67  42
     2학년  31  36
2021 1학년  41  58
     2학년  43  39

In [42]:
df['홍길동','국어']
df['홍길동']['국어']

년도    학년
2020  1학년    67
      2학년    31
2021  1학년    41
      2학년    43
Name: 국어, dtype: int32

In [43]:
df.rename(index={2021:2022})  #인덱스 이름 바꾸기

         홍길동     이순신     임꺽정
          국어  영어  국어  영어  국어  영어
년도   학년
2020 1학년  67  42  39  35  94  46
     2학년  31  36  55  80  50  48
2022 1학년  41  58  59  44  80  98
     2학년  43  39  37  93  91  52

In [44]:
df.rename(columns={'홍길동':'홍길동1','임꺽정':'임꺽정1'})

         홍길동1     이순신     임꺽정1
           국어  영어  국어  영어   국어  영어
년도   학년
2020 1학년   67  42  39  35   94  46
     2학년   31  36  55  80   50  48
2021 1학년   41  58  59  44   80  98
     2학년   43  39  37  93   91  52

In [47]:
df['임꺽정']['영어'].astype(np.float32)

년도    학년
2020  1학년    46.0
      2학년    48.0
2021  1학년    98.0
      2학년    52.0
Name: 영어, dtype: float32